Revit 2027 API
StructuralSection.TorsionalMomentOfInertia Property
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TorsionalMomentOfInertia { get; set; }
Public Property TorsionalMomentOfInertia As Double
	Get
	Set
public:
property double TorsionalMomentOfInertia {
	double get ();
	void set (double value);
}
member TorsionalMomentOfInertia : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace